---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.InsulationThickness
source: html/70cdade6-f49f-e945-2314-ca4b2ee00cca.htm
---
# Autodesk.Revit.DB.FabricationPart.InsulationThickness Property

The insulation thickness of the fabrication part. If the fabrication part is not insulated, returns zero.

## Syntax (C#)
```csharp
public double InsulationThickness { get; }
```